; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p3---int100n150-m25---int100c150---s37---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 level123 level124 level125 level126 level127 level128 level129 level130 level131 level132 level133 - fuellevel
)

(:init
(sum level0 level7 level7)
(sum level0 level8 level8)
(sum level0 level12 level12)
(sum level0 level14 level14)
(sum level0 level20 level20)
(sum level0 level23 level23)
(sum level0 level24 level24)
(sum level0 level25 level25)
(sum level1 level7 level8)
(sum level1 level8 level9)
(sum level1 level12 level13)
(sum level1 level14 level15)
(sum level1 level20 level21)
(sum level1 level23 level24)
(sum level1 level24 level25)
(sum level1 level25 level26)
(sum level2 level7 level9)
(sum level2 level8 level10)
(sum level2 level12 level14)
(sum level2 level14 level16)
(sum level2 level20 level22)
(sum level2 level23 level25)
(sum level2 level24 level26)
(sum level2 level25 level27)
(sum level3 level7 level10)
(sum level3 level8 level11)
(sum level3 level12 level15)
(sum level3 level14 level17)
(sum level3 level20 level23)
(sum level3 level23 level26)
(sum level3 level24 level27)
(sum level3 level25 level28)
(sum level4 level7 level11)
(sum level4 level8 level12)
(sum level4 level12 level16)
(sum level4 level14 level18)
(sum level4 level20 level24)
(sum level4 level23 level27)
(sum level4 level24 level28)
(sum level4 level25 level29)
(sum level5 level7 level12)
(sum level5 level8 level13)
(sum level5 level12 level17)
(sum level5 level14 level19)
(sum level5 level20 level25)
(sum level5 level23 level28)
(sum level5 level24 level29)
(sum level5 level25 level30)
(sum level6 level7 level13)
(sum level6 level8 level14)
(sum level6 level12 level18)
(sum level6 level14 level20)
(sum level6 level20 level26)
(sum level6 level23 level29)
(sum level6 level24 level30)
(sum level6 level25 level31)
(sum level7 level7 level14)
(sum level7 level8 level15)
(sum level7 level12 level19)
(sum level7 level14 level21)
(sum level7 level20 level27)
(sum level7 level23 level30)
(sum level7 level24 level31)
(sum level7 level25 level32)
(sum level8 level7 level15)
(sum level8 level8 level16)
(sum level8 level12 level20)
(sum level8 level14 level22)
(sum level8 level20 level28)
(sum level8 level23 level31)
(sum level8 level24 level32)
(sum level8 level25 level33)
(sum level9 level7 level16)
(sum level9 level8 level17)
(sum level9 level12 level21)
(sum level9 level14 level23)
(sum level9 level20 level29)
(sum level9 level23 level32)
(sum level9 level24 level33)
(sum level9 level25 level34)
(sum level10 level7 level17)
(sum level10 level8 level18)
(sum level10 level12 level22)
(sum level10 level14 level24)
(sum level10 level20 level30)
(sum level10 level23 level33)
(sum level10 level24 level34)
(sum level10 level25 level35)
(sum level11 level7 level18)
(sum level11 level8 level19)
(sum level11 level12 level23)
(sum level11 level14 level25)
(sum level11 level20 level31)
(sum level11 level23 level34)
(sum level11 level24 level35)
(sum level11 level25 level36)
(sum level12 level7 level19)
(sum level12 level8 level20)
(sum level12 level12 level24)
(sum level12 level14 level26)
(sum level12 level20 level32)
(sum level12 level23 level35)
(sum level12 level24 level36)
(sum level12 level25 level37)
(sum level13 level7 level20)
(sum level13 level8 level21)
(sum level13 level12 level25)
(sum level13 level14 level27)
(sum level13 level20 level33)
(sum level13 level23 level36)
(sum level13 level24 level37)
(sum level13 level25 level38)
(sum level14 level7 level21)
(sum level14 level8 level22)
(sum level14 level12 level26)
(sum level14 level14 level28)
(sum level14 level20 level34)
(sum level14 level23 level37)
(sum level14 level24 level38)
(sum level14 level25 level39)
(sum level15 level7 level22)
(sum level15 level8 level23)
(sum level15 level12 level27)
(sum level15 level14 level29)
(sum level15 level20 level35)
(sum level15 level23 level38)
(sum level15 level24 level39)
(sum level15 level25 level40)
(sum level16 level7 level23)
(sum level16 level8 level24)
(sum level16 level12 level28)
(sum level16 level14 level30)
(sum level16 level20 level36)
(sum level16 level23 level39)
(sum level16 level24 level40)
(sum level16 level25 level41)
(sum level17 level7 level24)
(sum level17 level8 level25)
(sum level17 level12 level29)
(sum level17 level14 level31)
(sum level17 level20 level37)
(sum level17 level23 level40)
(sum level17 level24 level41)
(sum level17 level25 level42)
(sum level18 level7 level25)
(sum level18 level8 level26)
(sum level18 level12 level30)
(sum level18 level14 level32)
(sum level18 level20 level38)
(sum level18 level23 level41)
(sum level18 level24 level42)
(sum level18 level25 level43)
(sum level19 level7 level26)
(sum level19 level8 level27)
(sum level19 level12 level31)
(sum level19 level14 level33)
(sum level19 level20 level39)
(sum level19 level23 level42)
(sum level19 level24 level43)
(sum level19 level25 level44)
(sum level20 level7 level27)
(sum level20 level8 level28)
(sum level20 level12 level32)
(sum level20 level14 level34)
(sum level20 level20 level40)
(sum level20 level23 level43)
(sum level20 level24 level44)
(sum level20 level25 level45)
(sum level21 level7 level28)
(sum level21 level8 level29)
(sum level21 level12 level33)
(sum level21 level14 level35)
(sum level21 level20 level41)
(sum level21 level23 level44)
(sum level21 level24 level45)
(sum level21 level25 level46)
(sum level22 level7 level29)
(sum level22 level8 level30)
(sum level22 level12 level34)
(sum level22 level14 level36)
(sum level22 level20 level42)
(sum level22 level23 level45)
(sum level22 level24 level46)
(sum level22 level25 level47)
(sum level23 level7 level30)
(sum level23 level8 level31)
(sum level23 level12 level35)
(sum level23 level14 level37)
(sum level23 level20 level43)
(sum level23 level23 level46)
(sum level23 level24 level47)
(sum level23 level25 level48)
(sum level24 level7 level31)
(sum level24 level8 level32)
(sum level24 level12 level36)
(sum level24 level14 level38)
(sum level24 level20 level44)
(sum level24 level23 level47)
(sum level24 level24 level48)
(sum level24 level25 level49)
(sum level25 level7 level32)
(sum level25 level8 level33)
(sum level25 level12 level37)
(sum level25 level14 level39)
(sum level25 level20 level45)
(sum level25 level23 level48)
(sum level25 level24 level49)
(sum level25 level25 level50)
(sum level26 level7 level33)
(sum level26 level8 level34)
(sum level26 level12 level38)
(sum level26 level14 level40)
(sum level26 level20 level46)
(sum level26 level23 level49)
(sum level26 level24 level50)
(sum level26 level25 level51)
(sum level27 level7 level34)
(sum level27 level8 level35)
(sum level27 level12 level39)
(sum level27 level14 level41)
(sum level27 level20 level47)
(sum level27 level23 level50)
(sum level27 level24 level51)
(sum level27 level25 level52)
(sum level28 level7 level35)
(sum level28 level8 level36)
(sum level28 level12 level40)
(sum level28 level14 level42)
(sum level28 level20 level48)
(sum level28 level23 level51)
(sum level28 level24 level52)
(sum level28 level25 level53)
(sum level29 level7 level36)
(sum level29 level8 level37)
(sum level29 level12 level41)
(sum level29 level14 level43)
(sum level29 level20 level49)
(sum level29 level23 level52)
(sum level29 level24 level53)
(sum level29 level25 level54)
(sum level30 level7 level37)
(sum level30 level8 level38)
(sum level30 level12 level42)
(sum level30 level14 level44)
(sum level30 level20 level50)
(sum level30 level23 level53)
(sum level30 level24 level54)
(sum level30 level25 level55)
(sum level31 level7 level38)
(sum level31 level8 level39)
(sum level31 level12 level43)
(sum level31 level14 level45)
(sum level31 level20 level51)
(sum level31 level23 level54)
(sum level31 level24 level55)
(sum level31 level25 level56)
(sum level32 level7 level39)
(sum level32 level8 level40)
(sum level32 level12 level44)
(sum level32 level14 level46)
(sum level32 level20 level52)
(sum level32 level23 level55)
(sum level32 level24 level56)
(sum level32 level25 level57)
(sum level33 level7 level40)
(sum level33 level8 level41)
(sum level33 level12 level45)
(sum level33 level14 level47)
(sum level33 level20 level53)
(sum level33 level23 level56)
(sum level33 level24 level57)
(sum level33 level25 level58)
(sum level34 level7 level41)
(sum level34 level8 level42)
(sum level34 level12 level46)
(sum level34 level14 level48)
(sum level34 level20 level54)
(sum level34 level23 level57)
(sum level34 level24 level58)
(sum level34 level25 level59)
(sum level35 level7 level42)
(sum level35 level8 level43)
(sum level35 level12 level47)
(sum level35 level14 level49)
(sum level35 level20 level55)
(sum level35 level23 level58)
(sum level35 level24 level59)
(sum level35 level25 level60)
(sum level36 level7 level43)
(sum level36 level8 level44)
(sum level36 level12 level48)
(sum level36 level14 level50)
(sum level36 level20 level56)
(sum level36 level23 level59)
(sum level36 level24 level60)
(sum level36 level25 level61)
(sum level37 level7 level44)
(sum level37 level8 level45)
(sum level37 level12 level49)
(sum level37 level14 level51)
(sum level37 level20 level57)
(sum level37 level23 level60)
(sum level37 level24 level61)
(sum level37 level25 level62)
(sum level38 level7 level45)
(sum level38 level8 level46)
(sum level38 level12 level50)
(sum level38 level14 level52)
(sum level38 level20 level58)
(sum level38 level23 level61)
(sum level38 level24 level62)
(sum level38 level25 level63)
(sum level39 level7 level46)
(sum level39 level8 level47)
(sum level39 level12 level51)
(sum level39 level14 level53)
(sum level39 level20 level59)
(sum level39 level23 level62)
(sum level39 level24 level63)
(sum level39 level25 level64)
(sum level40 level7 level47)
(sum level40 level8 level48)
(sum level40 level12 level52)
(sum level40 level14 level54)
(sum level40 level20 level60)
(sum level40 level23 level63)
(sum level40 level24 level64)
(sum level40 level25 level65)
(sum level41 level7 level48)
(sum level41 level8 level49)
(sum level41 level12 level53)
(sum level41 level14 level55)
(sum level41 level20 level61)
(sum level41 level23 level64)
(sum level41 level24 level65)
(sum level41 level25 level66)
(sum level42 level7 level49)
(sum level42 level8 level50)
(sum level42 level12 level54)
(sum level42 level14 level56)
(sum level42 level20 level62)
(sum level42 level23 level65)
(sum level42 level24 level66)
(sum level42 level25 level67)
(sum level43 level7 level50)
(sum level43 level8 level51)
(sum level43 level12 level55)
(sum level43 level14 level57)
(sum level43 level20 level63)
(sum level43 level23 level66)
(sum level43 level24 level67)
(sum level43 level25 level68)
(sum level44 level7 level51)
(sum level44 level8 level52)
(sum level44 level12 level56)
(sum level44 level14 level58)
(sum level44 level20 level64)
(sum level44 level23 level67)
(sum level44 level24 level68)
(sum level44 level25 level69)
(sum level45 level7 level52)
(sum level45 level8 level53)
(sum level45 level12 level57)
(sum level45 level14 level59)
(sum level45 level20 level65)
(sum level45 level23 level68)
(sum level45 level24 level69)
(sum level45 level25 level70)
(sum level46 level7 level53)
(sum level46 level8 level54)
(sum level46 level12 level58)
(sum level46 level14 level60)
(sum level46 level20 level66)
(sum level46 level23 level69)
(sum level46 level24 level70)
(sum level46 level25 level71)
(sum level47 level7 level54)
(sum level47 level8 level55)
(sum level47 level12 level59)
(sum level47 level14 level61)
(sum level47 level20 level67)
(sum level47 level23 level70)
(sum level47 level24 level71)
(sum level47 level25 level72)
(sum level48 level7 level55)
(sum level48 level8 level56)
(sum level48 level12 level60)
(sum level48 level14 level62)
(sum level48 level20 level68)
(sum level48 level23 level71)
(sum level48 level24 level72)
(sum level48 level25 level73)
(sum level49 level7 level56)
(sum level49 level8 level57)
(sum level49 level12 level61)
(sum level49 level14 level63)
(sum level49 level20 level69)
(sum level49 level23 level72)
(sum level49 level24 level73)
(sum level49 level25 level74)
(sum level50 level7 level57)
(sum level50 level8 level58)
(sum level50 level12 level62)
(sum level50 level14 level64)
(sum level50 level20 level70)
(sum level50 level23 level73)
(sum level50 level24 level74)
(sum level50 level25 level75)
(sum level51 level7 level58)
(sum level51 level8 level59)
(sum level51 level12 level63)
(sum level51 level14 level65)
(sum level51 level20 level71)
(sum level51 level23 level74)
(sum level51 level24 level75)
(sum level51 level25 level76)
(sum level52 level7 level59)
(sum level52 level8 level60)
(sum level52 level12 level64)
(sum level52 level14 level66)
(sum level52 level20 level72)
(sum level52 level23 level75)
(sum level52 level24 level76)
(sum level52 level25 level77)
(sum level53 level7 level60)
(sum level53 level8 level61)
(sum level53 level12 level65)
(sum level53 level14 level67)
(sum level53 level20 level73)
(sum level53 level23 level76)
(sum level53 level24 level77)
(sum level53 level25 level78)
(sum level54 level7 level61)
(sum level54 level8 level62)
(sum level54 level12 level66)
(sum level54 level14 level68)
(sum level54 level20 level74)
(sum level54 level23 level77)
(sum level54 level24 level78)
(sum level54 level25 level79)
(sum level55 level7 level62)
(sum level55 level8 level63)
(sum level55 level12 level67)
(sum level55 level14 level69)
(sum level55 level20 level75)
(sum level55 level23 level78)
(sum level55 level24 level79)
(sum level55 level25 level80)
(sum level56 level7 level63)
(sum level56 level8 level64)
(sum level56 level12 level68)
(sum level56 level14 level70)
(sum level56 level20 level76)
(sum level56 level23 level79)
(sum level56 level24 level80)
(sum level56 level25 level81)
(sum level57 level7 level64)
(sum level57 level8 level65)
(sum level57 level12 level69)
(sum level57 level14 level71)
(sum level57 level20 level77)
(sum level57 level23 level80)
(sum level57 level24 level81)
(sum level57 level25 level82)
(sum level58 level7 level65)
(sum level58 level8 level66)
(sum level58 level12 level70)
(sum level58 level14 level72)
(sum level58 level20 level78)
(sum level58 level23 level81)
(sum level58 level24 level82)
(sum level58 level25 level83)
(sum level59 level7 level66)
(sum level59 level8 level67)
(sum level59 level12 level71)
(sum level59 level14 level73)
(sum level59 level20 level79)
(sum level59 level23 level82)
(sum level59 level24 level83)
(sum level59 level25 level84)
(sum level60 level7 level67)
(sum level60 level8 level68)
(sum level60 level12 level72)
(sum level60 level14 level74)
(sum level60 level20 level80)
(sum level60 level23 level83)
(sum level60 level24 level84)
(sum level60 level25 level85)
(sum level61 level7 level68)
(sum level61 level8 level69)
(sum level61 level12 level73)
(sum level61 level14 level75)
(sum level61 level20 level81)
(sum level61 level23 level84)
(sum level61 level24 level85)
(sum level61 level25 level86)
(sum level62 level7 level69)
(sum level62 level8 level70)
(sum level62 level12 level74)
(sum level62 level14 level76)
(sum level62 level20 level82)
(sum level62 level23 level85)
(sum level62 level24 level86)
(sum level62 level25 level87)
(sum level63 level7 level70)
(sum level63 level8 level71)
(sum level63 level12 level75)
(sum level63 level14 level77)
(sum level63 level20 level83)
(sum level63 level23 level86)
(sum level63 level24 level87)
(sum level63 level25 level88)
(sum level64 level7 level71)
(sum level64 level8 level72)
(sum level64 level12 level76)
(sum level64 level14 level78)
(sum level64 level20 level84)
(sum level64 level23 level87)
(sum level64 level24 level88)
(sum level64 level25 level89)
(sum level65 level7 level72)
(sum level65 level8 level73)
(sum level65 level12 level77)
(sum level65 level14 level79)
(sum level65 level20 level85)
(sum level65 level23 level88)
(sum level65 level24 level89)
(sum level65 level25 level90)
(sum level66 level7 level73)
(sum level66 level8 level74)
(sum level66 level12 level78)
(sum level66 level14 level80)
(sum level66 level20 level86)
(sum level66 level23 level89)
(sum level66 level24 level90)
(sum level66 level25 level91)
(sum level67 level7 level74)
(sum level67 level8 level75)
(sum level67 level12 level79)
(sum level67 level14 level81)
(sum level67 level20 level87)
(sum level67 level23 level90)
(sum level67 level24 level91)
(sum level67 level25 level92)
(sum level68 level7 level75)
(sum level68 level8 level76)
(sum level68 level12 level80)
(sum level68 level14 level82)
(sum level68 level20 level88)
(sum level68 level23 level91)
(sum level68 level24 level92)
(sum level68 level25 level93)
(sum level69 level7 level76)
(sum level69 level8 level77)
(sum level69 level12 level81)
(sum level69 level14 level83)
(sum level69 level20 level89)
(sum level69 level23 level92)
(sum level69 level24 level93)
(sum level69 level25 level94)
(sum level70 level7 level77)
(sum level70 level8 level78)
(sum level70 level12 level82)
(sum level70 level14 level84)
(sum level70 level20 level90)
(sum level70 level23 level93)
(sum level70 level24 level94)
(sum level70 level25 level95)
(sum level71 level7 level78)
(sum level71 level8 level79)
(sum level71 level12 level83)
(sum level71 level14 level85)
(sum level71 level20 level91)
(sum level71 level23 level94)
(sum level71 level24 level95)
(sum level71 level25 level96)
(sum level72 level7 level79)
(sum level72 level8 level80)
(sum level72 level12 level84)
(sum level72 level14 level86)
(sum level72 level20 level92)
(sum level72 level23 level95)
(sum level72 level24 level96)
(sum level72 level25 level97)
(sum level73 level7 level80)
(sum level73 level8 level81)
(sum level73 level12 level85)
(sum level73 level14 level87)
(sum level73 level20 level93)
(sum level73 level23 level96)
(sum level73 level24 level97)
(sum level73 level25 level98)
(sum level74 level7 level81)
(sum level74 level8 level82)
(sum level74 level12 level86)
(sum level74 level14 level88)
(sum level74 level20 level94)
(sum level74 level23 level97)
(sum level74 level24 level98)
(sum level74 level25 level99)
(sum level75 level7 level82)
(sum level75 level8 level83)
(sum level75 level12 level87)
(sum level75 level14 level89)
(sum level75 level20 level95)
(sum level75 level23 level98)
(sum level75 level24 level99)
(sum level75 level25 level100)
(sum level76 level7 level83)
(sum level76 level8 level84)
(sum level76 level12 level88)
(sum level76 level14 level90)
(sum level76 level20 level96)
(sum level76 level23 level99)
(sum level76 level24 level100)
(sum level76 level25 level101)
(sum level77 level7 level84)
(sum level77 level8 level85)
(sum level77 level12 level89)
(sum level77 level14 level91)
(sum level77 level20 level97)
(sum level77 level23 level100)
(sum level77 level24 level101)
(sum level77 level25 level102)
(sum level78 level7 level85)
(sum level78 level8 level86)
(sum level78 level12 level90)
(sum level78 level14 level92)
(sum level78 level20 level98)
(sum level78 level23 level101)
(sum level78 level24 level102)
(sum level78 level25 level103)
(sum level79 level7 level86)
(sum level79 level8 level87)
(sum level79 level12 level91)
(sum level79 level14 level93)
(sum level79 level20 level99)
(sum level79 level23 level102)
(sum level79 level24 level103)
(sum level79 level25 level104)
(sum level80 level7 level87)
(sum level80 level8 level88)
(sum level80 level12 level92)
(sum level80 level14 level94)
(sum level80 level20 level100)
(sum level80 level23 level103)
(sum level80 level24 level104)
(sum level80 level25 level105)
(sum level81 level7 level88)
(sum level81 level8 level89)
(sum level81 level12 level93)
(sum level81 level14 level95)
(sum level81 level20 level101)
(sum level81 level23 level104)
(sum level81 level24 level105)
(sum level81 level25 level106)
(sum level82 level7 level89)
(sum level82 level8 level90)
(sum level82 level12 level94)
(sum level82 level14 level96)
(sum level82 level20 level102)
(sum level82 level23 level105)
(sum level82 level24 level106)
(sum level82 level25 level107)
(sum level83 level7 level90)
(sum level83 level8 level91)
(sum level83 level12 level95)
(sum level83 level14 level97)
(sum level83 level20 level103)
(sum level83 level23 level106)
(sum level83 level24 level107)
(sum level83 level25 level108)
(sum level84 level7 level91)
(sum level84 level8 level92)
(sum level84 level12 level96)
(sum level84 level14 level98)
(sum level84 level20 level104)
(sum level84 level23 level107)
(sum level84 level24 level108)
(sum level84 level25 level109)
(sum level85 level7 level92)
(sum level85 level8 level93)
(sum level85 level12 level97)
(sum level85 level14 level99)
(sum level85 level20 level105)
(sum level85 level23 level108)
(sum level85 level24 level109)
(sum level85 level25 level110)
(sum level86 level7 level93)
(sum level86 level8 level94)
(sum level86 level12 level98)
(sum level86 level14 level100)
(sum level86 level20 level106)
(sum level86 level23 level109)
(sum level86 level24 level110)
(sum level86 level25 level111)
(sum level87 level7 level94)
(sum level87 level8 level95)
(sum level87 level12 level99)
(sum level87 level14 level101)
(sum level87 level20 level107)
(sum level87 level23 level110)
(sum level87 level24 level111)
(sum level87 level25 level112)
(sum level88 level7 level95)
(sum level88 level8 level96)
(sum level88 level12 level100)
(sum level88 level14 level102)
(sum level88 level20 level108)
(sum level88 level23 level111)
(sum level88 level24 level112)
(sum level88 level25 level113)
(sum level89 level7 level96)
(sum level89 level8 level97)
(sum level89 level12 level101)
(sum level89 level14 level103)
(sum level89 level20 level109)
(sum level89 level23 level112)
(sum level89 level24 level113)
(sum level89 level25 level114)
(sum level90 level7 level97)
(sum level90 level8 level98)
(sum level90 level12 level102)
(sum level90 level14 level104)
(sum level90 level20 level110)
(sum level90 level23 level113)
(sum level90 level24 level114)
(sum level90 level25 level115)
(sum level91 level7 level98)
(sum level91 level8 level99)
(sum level91 level12 level103)
(sum level91 level14 level105)
(sum level91 level20 level111)
(sum level91 level23 level114)
(sum level91 level24 level115)
(sum level91 level25 level116)
(sum level92 level7 level99)
(sum level92 level8 level100)
(sum level92 level12 level104)
(sum level92 level14 level106)
(sum level92 level20 level112)
(sum level92 level23 level115)
(sum level92 level24 level116)
(sum level92 level25 level117)
(sum level93 level7 level100)
(sum level93 level8 level101)
(sum level93 level12 level105)
(sum level93 level14 level107)
(sum level93 level20 level113)
(sum level93 level23 level116)
(sum level93 level24 level117)
(sum level93 level25 level118)
(sum level94 level7 level101)
(sum level94 level8 level102)
(sum level94 level12 level106)
(sum level94 level14 level108)
(sum level94 level20 level114)
(sum level94 level23 level117)
(sum level94 level24 level118)
(sum level94 level25 level119)
(sum level95 level7 level102)
(sum level95 level8 level103)
(sum level95 level12 level107)
(sum level95 level14 level109)
(sum level95 level20 level115)
(sum level95 level23 level118)
(sum level95 level24 level119)
(sum level95 level25 level120)
(sum level96 level7 level103)
(sum level96 level8 level104)
(sum level96 level12 level108)
(sum level96 level14 level110)
(sum level96 level20 level116)
(sum level96 level23 level119)
(sum level96 level24 level120)
(sum level96 level25 level121)
(sum level97 level7 level104)
(sum level97 level8 level105)
(sum level97 level12 level109)
(sum level97 level14 level111)
(sum level97 level20 level117)
(sum level97 level23 level120)
(sum level97 level24 level121)
(sum level97 level25 level122)
(sum level98 level7 level105)
(sum level98 level8 level106)
(sum level98 level12 level110)
(sum level98 level14 level112)
(sum level98 level20 level118)
(sum level98 level23 level121)
(sum level98 level24 level122)
(sum level98 level25 level123)
(sum level99 level7 level106)
(sum level99 level8 level107)
(sum level99 level12 level111)
(sum level99 level14 level113)
(sum level99 level20 level119)
(sum level99 level23 level122)
(sum level99 level24 level123)
(sum level99 level25 level124)
(sum level100 level7 level107)
(sum level100 level8 level108)
(sum level100 level12 level112)
(sum level100 level14 level114)
(sum level100 level20 level120)
(sum level100 level23 level123)
(sum level100 level24 level124)
(sum level100 level25 level125)
(sum level101 level7 level108)
(sum level101 level8 level109)
(sum level101 level12 level113)
(sum level101 level14 level115)
(sum level101 level20 level121)
(sum level101 level23 level124)
(sum level101 level24 level125)
(sum level101 level25 level126)
(sum level102 level7 level109)
(sum level102 level8 level110)
(sum level102 level12 level114)
(sum level102 level14 level116)
(sum level102 level20 level122)
(sum level102 level23 level125)
(sum level102 level24 level126)
(sum level102 level25 level127)
(sum level103 level7 level110)
(sum level103 level8 level111)
(sum level103 level12 level115)
(sum level103 level14 level117)
(sum level103 level20 level123)
(sum level103 level23 level126)
(sum level103 level24 level127)
(sum level103 level25 level128)
(sum level104 level7 level111)
(sum level104 level8 level112)
(sum level104 level12 level116)
(sum level104 level14 level118)
(sum level104 level20 level124)
(sum level104 level23 level127)
(sum level104 level24 level128)
(sum level104 level25 level129)
(sum level105 level7 level112)
(sum level105 level8 level113)
(sum level105 level12 level117)
(sum level105 level14 level119)
(sum level105 level20 level125)
(sum level105 level23 level128)
(sum level105 level24 level129)
(sum level105 level25 level130)
(sum level106 level7 level113)
(sum level106 level8 level114)
(sum level106 level12 level118)
(sum level106 level14 level120)
(sum level106 level20 level126)
(sum level106 level23 level129)
(sum level106 level24 level130)
(sum level106 level25 level131)
(sum level107 level7 level114)
(sum level107 level8 level115)
(sum level107 level12 level119)
(sum level107 level14 level121)
(sum level107 level20 level127)
(sum level107 level23 level130)
(sum level107 level24 level131)
(sum level107 level25 level132)
(sum level108 level7 level115)
(sum level108 level8 level116)
(sum level108 level12 level120)
(sum level108 level14 level122)
(sum level108 level20 level128)
(sum level108 level23 level131)
(sum level108 level24 level132)
(sum level108 level25 level133)
(sum level109 level7 level116)
(sum level109 level8 level117)
(sum level109 level12 level121)
(sum level109 level14 level123)
(sum level109 level20 level129)
(sum level109 level23 level132)
(sum level109 level24 level133)
(sum level110 level7 level117)
(sum level110 level8 level118)
(sum level110 level12 level122)
(sum level110 level14 level124)
(sum level110 level20 level130)
(sum level110 level23 level133)
(sum level111 level7 level118)
(sum level111 level8 level119)
(sum level111 level12 level123)
(sum level111 level14 level125)
(sum level111 level20 level131)
(sum level112 level7 level119)
(sum level112 level8 level120)
(sum level112 level12 level124)
(sum level112 level14 level126)
(sum level112 level20 level132)
(sum level113 level7 level120)
(sum level113 level8 level121)
(sum level113 level12 level125)
(sum level113 level14 level127)
(sum level113 level20 level133)
(sum level114 level7 level121)
(sum level114 level8 level122)
(sum level114 level12 level126)
(sum level114 level14 level128)
(sum level115 level7 level122)
(sum level115 level8 level123)
(sum level115 level12 level127)
(sum level115 level14 level129)
(sum level116 level7 level123)
(sum level116 level8 level124)
(sum level116 level12 level128)
(sum level116 level14 level130)
(sum level117 level7 level124)
(sum level117 level8 level125)
(sum level117 level12 level129)
(sum level117 level14 level131)
(sum level118 level7 level125)
(sum level118 level8 level126)
(sum level118 level12 level130)
(sum level118 level14 level132)
(sum level119 level7 level126)
(sum level119 level8 level127)
(sum level119 level12 level131)
(sum level119 level14 level133)
(sum level120 level7 level127)
(sum level120 level8 level128)
(sum level120 level12 level132)
(sum level121 level7 level128)
(sum level121 level8 level129)
(sum level121 level12 level133)
(sum level122 level7 level129)
(sum level122 level8 level130)
(sum level123 level7 level130)
(sum level123 level8 level131)
(sum level124 level7 level131)
(sum level124 level8 level132)
(sum level125 level7 level132)
(sum level125 level8 level133)
(sum level126 level7 level133)

(connected l0 l1)
(fuelcost level8 l0 l1)
(connected l0 l3)
(fuelcost level24 l0 l3)
(connected l0 l4)
(fuelcost level14 l0 l4)
(connected l0 l5)
(fuelcost level7 l0 l5)
(connected l1 l0)
(fuelcost level8 l1 l0)
(connected l1 l4)
(fuelcost level25 l1 l4)
(connected l2 l3)
(fuelcost level23 l2 l3)
(connected l2 l4)
(fuelcost level20 l2 l4)
(connected l3 l0)
(fuelcost level24 l3 l0)
(connected l3 l2)
(fuelcost level23 l3 l2)
(connected l3 l4)
(fuelcost level25 l3 l4)
(connected l3 l5)
(fuelcost level12 l3 l5)
(connected l4 l0)
(fuelcost level14 l4 l0)
(connected l4 l1)
(fuelcost level25 l4 l1)
(connected l4 l2)
(fuelcost level20 l4 l2)
(connected l4 l3)
(fuelcost level25 l4 l3)
(connected l5 l0)
(fuelcost level7 l5 l0)
(connected l5 l3)
(fuelcost level12 l5 l3)

(at t0 l4)
(fuel t0 level133)
(= (total-cost) 0)

(at p0 l1)
(at p1 l2)
(at p2 l2)
)

(:goal
(and
(at p0 l3)
(at p1 l4)
(at p2 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l4 l2 level113 level20 level133)
   deleted: (at t0 l4) (fuel t0 level133)
   added: (at t0 l2) (fuel t0 level113)
   goals met: 0 of 3
2. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 0 of 3
3. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 0 of 3
4. (drive t0 l2 l4 level93 level20 level113)
   deleted: (at t0 l2) (fuel t0 level113)
   added: (at t0 l4) (fuel t0 level93)
   goals met: 0 of 3
5. (unload p1 t0 l4)
   deleted: (in p1 t0)
   added: (at p1 l4)
   goals met: 1 of 3
6. (drive t0 l4 l1 level68 level25 level93)
   deleted: (at t0 l4) (fuel t0 level93)
   added: (at t0 l1) (fuel t0 level68)
   goals met: 1 of 3
7. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 1 of 3
8. (drive t0 l1 l0 level60 level8 level68)
   deleted: (at t0 l1) (fuel t0 level68)
   added: (at t0 l0) (fuel t0 level60)
   goals met: 1 of 3
9. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 2 of 3
10. (drive t0 l0 l3 level36 level24 level60)
   deleted: (at t0 l0) (fuel t0 level60)
   added: (at t0 l3) (fuel t0 level36)
   goals met: 2 of 3
11. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 3 of 3
